Tekla.Structures.Filtering.InvalidFilterExpressionException
The InvalidFilterExpressionException class represents an error that occurred during the expression evaluation.
This class cannot be inherited.

Tekla.Structures.Filtering.InvalidFilterExpressionException.#ctor(Tekla.Structures.Filtering.Expression,Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType)
Initializes a new instance of the InvalidFilterExpressionException class.
Expression: The invalid expression.
InvalidFilterExpressionExceptionReasonsType: The reason why the exception is thrown.

Tekla.Structures.Filtering.InvalidFilterExpressionException.#ctor(Tekla.Structures.Filtering.Expression,Tekla.Structures.Filtering.OperatorType,Tekla.Structures.Filtering.Expression,Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType)
Initializes a new instance of the InvalidFilterExpressionException class.
LeftExpression: The invalid expression's left operand.
OperatorType: The invalid expression's operator type.
RightExpression: The invalid expression's right operand.
InvalidFilterExpressionExceptionReasonsType: The reason why the exception is thrown.

Tekla.Structures.Filtering.InvalidFilterExpressionException.#ctor(Tekla.Structures.Filtering.Expression,Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType,System.Int32)
Initializes a new instance of the InvalidFilterExpressionException class.
Expression: The invalid expression.
InvalidFilterExpressionExceptionReasonsType: The reason why the exception is thrown.
MaximumExpressionNumber: The maximun number of expressions.

Tekla.Structures.Filtering.InvalidFilterExpressionException.Expression
Gets the invalid expression.

Tekla.Structures.Filtering.InvalidFilterExpressionException.InvalidFilterExpressionExceptionReasonsType
Gets the reason why the exception is thrown.

Tekla.Structures.Filtering.InvalidFilterExpressionException.LeftExpression
Gets the invalid expression's left operand.

Tekla.Structures.Filtering.InvalidFilterExpressionException.RightExpression
Gets the invalid expression's right operand.

Tekla.Structures.Filtering.InvalidFilterExpressionException.OperatorType
Gets the invalid expression's operator.